toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    [[gnu::section(".stack._TaskImg")]]
    alignas(void*)
    static inline uint8_t Stack[256];
};

// MARK: - _TaskMain

struct _TaskMain {
    static void Start() {
        _Scheduler::Start<_TaskMain>();
    }
    
    static void Reset() {
        // Reset our state
        _State = {};
        // Reset other tasks' state
        // This is necessary because we're stopping them at an arbitrary point
        _TaskSD::Init();
        _TaskImg::Init();
        // Stop tasks
        _Scheduler::Stop<_TaskSD>();
        _Scheduler::Stop<_TaskImg>();
        _Scheduler::Stop<_TaskMain>();
        // Turn off power
        _VDDIMGSDSet(false);
        _VDDBSet(false);
    }
    
    static void _TimeTrigger(_Triggers::TimeTriggerEvent& ev) {
        _Triggers::TimeTrigger& trigger = ev.trigger();
        // Schedule the CaptureImageEvent, but only if we're not in fast-forward mode
        if (!_State.fastForward) {
            _CaptureStart(trigger, ev.time);
        }
        // Reschedule TimeTriggerEvent for its next trigger time
        _EventInsert(ev, ev.repeat);
    }
    
    static void _MotionEnable(_Triggers::MotionEnableEvent& ev) {
        _Triggers::MotionTrigger& trigger = ev.trigger();
        
        // Enable motion
        trigger.enabled.set(true);
        
        // Schedule the MotionDisable event, if applicable
        // This needs to happen before we reschedule `motionEnableEvent` because we need its .time to
        // properly schedule the MotionDisableEvent!
        const uint32_t durationMs = trigger.base().durationMs;
        if (durationMs) {
            _EventInsert((_Triggers::MotionDisableEvent&)trigger, ev.time, durationMs);
        }
        
        // Reschedule MotionEnableEvent for its next trigger time
        _EventInsert(ev, ev.repeat);
    }
    
    static void _MotionDisable(_Triggers::MotionDisableEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        trigger.enabled.set(false);
    }
    
    static void _MotionUnsuppress(_Triggers::MotionUnsuppressEvent& ev) {
        // We should never get a MotionUnsuppressEvent event while in fast-forward mode
        Assert(!_State.fastForward);
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        trigger.enabled.suppress(false);
    }
    
    static void _CaptureImage(_Triggers::CaptureImageEvent& ev) {
        // We should never get a CaptureImageEvent event while in fast-forward mode
        Assert(!_State.fastForward);
        
        constexpr MSP::ImgRingBuf& imgRingBuf = ::_State.sd.imgRingBufs[0];
        
        const bool green = ev.capture->leds & MSP::LEDs_::Green;
        const bool red = ev.capture->leds & MSP::LEDs_::Red;
        _LEDGreen_.set(_LEDPriority::Capture, !green);
        _LEDRed_.set(_LEDPriority::Capture, !red);
        
        // Turn on VDD_B power (turns on ICE40)
        _VDDBSet(true);
        
        // Wait for ICE40 to start
        // We specify (within the bitstream itself, via icepack) that ICE40 should load
        // the bitstream at high-frequency (40 MHz).
        // According to the datasheet, this takes 70ms.
        _Scheduler::Sleep(_Scheduler::Ms(30));
        _ICEInit();
        
        // Reset SD nets before we turn on SD power
        _TaskSD::CardReset();
        _TaskSD::Wait();
        
        // Turn on IMG/SD power
        _VDDIMGSDSet(true);
        
        // Init image sensor / SD card
        _TaskImg::SensorInit();
        _TaskSD::CardInit();
        
        // Capture an image
        {
            // Wait for _TaskSD to be initialized and done with writing, which is necessary
            // for 2 reasons:
            //   1. we have to wait for _TaskSD to initialize _State.sd.imgRingBufs before we
            //      access it,
            //   2. we can't initiate a new capture until writing to the SD card (from a
            //      previous capture) is complete (because the SDRAM is single-port, so
            //      we can only read or write at one time)
            _TaskSD::WaitForInitAndWrite();
            
            // Capture image to RAM
            _TaskImg::Capture(imgRingBuf.buf.id);
            const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
            
            // Copy image from RAM -> SD card
            _TaskSD::Write(srcRAMBlock);
            _TaskSD::Wait();
        }
        
//            for (;;) {
//                // Capture an image
//                {
//                    // Wait for _TaskSD to be initialized and done with writing, which is necessary
//                    // for 2 reasons:
//                    //   1. we have to wait for _TaskSD to initialize _State.sd.imgRingBufs before we
//                    //      access it,
//                    //   2. we can't initiate a new capture until writing to the SD card (from a
//                    //      previous capture) is complete (because the SDRAM is single-port, so
//                    //      we can only read or write at one time)
//                    _TaskSD::WaitForInitAndWrite();
//                    
//                    // Capture image to RAM
//                    _TaskImg::Capture(imgRingBuf.buf.id);
//                    const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
//                    
//                    // Copy image from RAM -> SD card
//                    _TaskSD::Write(srcRAMBlock);
//                    _TaskSD::Wait();
//                }
//                
//                break;
//                
////                // Wait up to 1s for further motion
////                const auto motion = _Scheduler::Wait(_Scheduler::Ms(1000), [] { return (bool)_Motion; });
////                if (!motion) break;
////                
////                // Only reset _Motion if we've observed motion; otherwise, if we always reset
////                // _Motion, there'd be a race window where we could first observe
////                // _Motion==false, but then the ISR sets _Motion=true, but then we clobber
////                // the true value by resetting it to false.
////                _Motion = false;
//            }
//        
//        if (trigger & _TriggerSources::Manual) {
//            _LEDRed_.set(_LEDPriority::Capture, 1);
//        }
        
        _LEDGreen_.set(_LEDPriority::Capture, std::nullopt);
        _LEDRed_.set(_LEDPriority::Capture, std::nullopt);
        
        _VDDIMGSDSet(false);
        _VDDBSet(false);
        
