toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        ev.countRem--;
        if (ev.countRem) {
            _EventInsert(ev, ev.time, ev.capture->delayMs);
        }
    }
    
    static _Triggers::Event* _EventPop() {
        _Triggers::Event* ev = _Triggers::EventPop(_RTC::TimeRead());
        // Exit fast-forward mode when we no longer have any events in the past
        if (!ev) {
            _State.fastForward = false;
        }
        return ev;
    }
    
    static void Run() {
//        for (bool x=false;; x=!x) {
//            _Pin::LED_RED_::Write(x);
//            _BatterySampler::Sample();
//            _Scheduler::Sleep(_Scheduler::Ms(1000));
//        }
        
//        // Handle cold starts
//        if (!_FirstRunDone) {
//            _FirstRunDone = true;
//            // Since this is a cold start, delay 3s before beginning.
//            // This delay is meant for the case where we restarted due to an abort, and
//            // serves 2 purposes:
//            //   1. it rate-limits aborts, in case there's a persistent issue
//            //   2. it allows GPIO outputs to settle, so that peripherals fully turn off
//            _LEDRed_.set(_LEDRed_::Priority::Low, 0);
//            _Scheduler::Sleep(_Scheduler::Ms(3000));
//            _LEDRed_.set(_LEDRed_::Priority::Low, 1);
//        }
//        
//        _Scheduler::Sleep(_Scheduler::Ms(10000));
        
//        _Pin::VDD_B_EN::Write(1);
//        _Scheduler::Sleep(_Scheduler::Ms(250));
//        
//        for (;;) {
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//        }
        
//        for (;;) {
//            _Scheduler::Sleep(_Scheduler::Ms(1000));
//        }
        
        // Reset our state
        Reset();
        
        // Init SPI peripheral
        _SPI::Init();
        
        // Init Triggers
        _Triggers::Init(_RTC::TimeRead());
        
        // Enter fast-forward mode while we pop every event that occurs in the past
        // (_EventPop() will exit from fast-forward mode)
        _State.fastForward = true;
        for (;;) {
//            // Wait for motion. During this block we allow LPM3.5 sleep, as long as our other tasks are idle.
//            {
//                _WaitingForMotion = true;
//                _Scheduler::Wait([&] { return (bool)_Motion; });
//                _Motion = false;
//                _WaitingForMotion = false;
//            }
            
            // Wait for an event
            static _Triggers::Event* ev = nullptr;
            _Scheduler::Wait([] { return (bool)(ev = _EventPop()); });
            
            // Stay powered while we handle the event
            _State.power = true;
            
//            TimeTrigger,        // idx: _TimeTrigger[]
//            MotionEnable,       // idx: _MotionTrigger[]
//            MotionDisable,      // idx: _MotionTrigger[]
//            MotionUnsuppress,   // idx: _MotionTrigger[]
//            CaptureImage,       // idx: _Capture[]
            
            using T = _Triggers::Event::Type;
            switch (ev->type) {
            case T::TimeTrigger:      _TimeTrigger((_Triggers::TimeTriggerEvent&)*ev);           break;
            case T::MotionEnable:     _MotionEnable((_Triggers::MotionEnableEvent&)*ev);         break;
            case T::MotionDisable:    _MotionDisable((_Triggers::MotionDisableEvent&)*ev);       break;
            case T::MotionUnsuppress: _MotionUnsuppress((_Triggers::MotionUnsuppressEvent&)*ev); break;
            case T::CaptureImage:     _CaptureImage((_Triggers::CaptureImageEvent&)*ev);         break;
            }
            
//            // Light the red LED if this is a manual trigger
//            if (trigger & _TriggerSources::Manual) {
//                _LEDRed_.set(_LEDPriority::Capture, 0);
//            }
            
            // Release power assertion
            _State.power = false;
            
//            // Release control of the LED
//            _LEDRed_.set(_LEDPriority::Capture, std::nullopt);
        }
    }
    
//    static bool DeepSleepOK() {
//        // Permit LPM3.5 if we're waiting for motion, and neither of our tasks are doing anything.
//        // This logic works because if _WaitingForMotion==true, then we've disabled both _TaskSD
//        // and _TaskImg, so if the tasks are idle, then everything's idle so we can enter deep
//        // sleep. (The case that we need to be careful of is going to sleep when either _TaskSD
//        // or _TaskImg is idle but still powered on, which the _WaitingForMotion check takes
//        // care of.)
//        return _WaitingForMotion                &&
//               !_Scheduler::Running<_TaskSD>()  &&
//               !_Scheduler::Running<_TaskImg>() ;
//    }
    
    static inline struct {
        // fastForward=true while initializing, where we execute events in 'fast-forward' mode,
        // solely to arrive at the correct state for the current time.
        // fastForward=false once we're done initializing and executing events normally.
        bool fastForward;
        // power: our active power assertion. This needs to be an ivar because TaskMain
        // can be reset at any time via our Reset() function, so if the power assertion
        // lived on the stack,
        _Powered::Assertion power;
    } _State = {};
    
    // Task stack
    [[gnu::section(".stack._TaskMain")]]
    alignas(void*)
    static inline uint8_t Stack[256];
};

static void _CapturePause() {
    _TaskMain::Reset();
}

static void _CaptureResume() {
    _TaskMain::Start();
}

// MARK: - _TaskI2C

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until the I2C lines are activated (ie VDD_B_3V3_STM becomes powered)
            _I2C::WaitUntilActive();
            
            // Maintain power while I2C is active
            _Powered::Assertion power(true);
            
