toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                // Send response
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            // Cleanup
            
//            // Relinquish LEDs, which may have been set by _CmdHandle()
            _LEDRed_.set(_LEDPriority::I2C, std::nullopt);
            _LEDGreen_.set(_LEDPriority::I2C, std::nullopt);
            
            // Exit host mode, in case we were in it
            _HostMode = false;
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.off;
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.off;
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            FRAMWriteEn writeEn; // Enable FRAM writing
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_.set(_LEDPriority::I2C, !cmd.arg.LEDSet.red);
            _LEDGreen_.set(_LEDPriority::I2C, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeGet:
            return MSP::Resp{
                .ok = true,
                .arg = { .TimeGet = { .time = _RTC::TimeRead() } },
            };
        
        case Cmd::Op::TimeSet:
            // Only allow setting the time while we're in host mode
            // and therefore TaskMain isn't running
            if (!_HostMode) return MSP::Resp{ .ok = false };
            _RTC::Init(cmd.arg.TimeSet.time);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::HostModeSet:
            if (cmd.arg.HostModeSet.en != _HostMode) {
                if (cmd.arg.HostModeSet.en) {
                    _HostMode = true;
                } else {
                    _HostMode = false;
                }
            }
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::VDDIMGSDSet:
            _VDDIMGSDSet(cmd.arg.VDDIMGSDSet.en);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::BatteryChargeLevelGet: {
            return MSP::Resp{
                .ok = true,
                .arg = { .BatteryChargeLevelGet = { .level = _BatterySampler::Sample() } },
            };
        }
        
        default:
            return MSP::Resp{ .ok = false };
        }
    }
    
    static bool HostModeEnabled() {
        return _HostMode;
    }
    
    static inline _CapturePaused::Assertion _HostMode;
    
    // Task stack
    [[gnu::section(".stack._TaskI2C")]]
    alignas(void*)
    static inline uint8_t Stack[256];
};

// MARK: - _TaskMotion

struct _TaskMotion {
    static void Run() {
        for (;;) {
            _Motion::WaitForMotion();
            // When motion occurs, start captures for each enabled motion trigger
            for (auto it=_Triggers::MotionTriggerBegin(); it!=_Triggers::MotionTriggerEnd(); it++) {
                _Triggers::MotionTrigger& trigger = *it;
                // If this trigger is enabled...
                if (trigger.enabled.get()) {
                    const Time::Instant time = _RTC::TimeRead();
                    // Start capture
                    _CaptureStart(trigger, time);
                    // Suppress motion for the specified duration, if suppression is enabled
                    const uint32_t suppressMs = trigger.base().suppressMs;
                    if (suppressMs) {
                        trigger.enabled.suppress(true);
                        _EventInsert((_Triggers::MotionUnsuppressEvent&)trigger, time, suppressMs);
                    }
                }
            }
        }
    }
    
    // Task stack
    [[gnu::section(".stack._TaskMotion")]]
    alignas(void*)
    static inline uint8_t Stack[128];
};

static void _MotionEnable() {
    _Motion::Enabled(true);
}

static void _MotionDisable() {
    _Motion::Enabled(false);
}

// MARK: - _TaskButton

#define _TaskButtonStackSize 128

[[gnu::section(".stack._TaskButton")]]
alignas(void*)
uint8_t _TaskButtonStack[_TaskButtonStackSize];

asm(".global _Stack");
asm(".equ _Stack, _TaskButtonStack+" Stringify(_TaskButtonStackSize));

struct _TaskButton {
    static void Run() {
        // Stop watchdog timer
        WDTCTL = WDTPW | WDTHOLD;
        
        // Init GPIOs
        GPIO::Init<
            // Power control
            _Pin::VDD_B_EN,
            _Pin::VDD_B_1V8_IMG_SD_EN,
            _Pin::VDD_B_2V8_IMG_SD_EN,
            
            // Clock (config chosen by _RTC)
            _RTC::Pin::XOUT,
            _RTC::Pin::XIN,
            
            // SPI (config chosen by _SPI)
            _SPI::Pin::Clk,
            _SPI::Pin::DataOut,
            _SPI::Pin::DataIn,
            
            // I2C (config chosen by _I2C)
            _I2C::Pin::SCL,
            _I2C::Pin::SDA,
            _I2C::Pin::Active,
            
            // Motion (config chosen by _Motion)
            _Motion::Pin::Power,
            _Motion::Pin::Signal,
            
            // Battery (config chosen by _BatterySampler)
            _BatterySampler::Pin::BatChrgLvlPin,
            _BatterySampler::Pin::BatChrgLvlEn_Pin,
            
            // Button (config chosen by _Button)
            _Button::Pin,
            
            // LEDs
            _Pin::LED_GREEN_,
            _Pin::LED_RED_
        >();
        
        // Init clock
        _Clock::Init();
        
        // Init RTC
        // We need RTC to be unconditionally enabled for 2 reasons:
        //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
        //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
        //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
        _RTC::Init();
        
        // Init SysTick
        _SysTick::Init();
        
        // Init BatterySampler
        _BatterySampler::Init();
        
        // Init LEDs by setting their default-priority / 'backstop' values to off.
        // This is necessary so that relinquishing the LEDs from I2C task causes
        // them to turn off. If we didn't have a backstop value, the LEDs would
        // remain in whatever state the I2C task set them to before relinquishing.
        _LEDGreen_.set(_LEDPriority::Default, 1);
        _LEDRed_.set(_LEDPriority::Default, 1);
        
    //    // Blink green LED to signal that we're turning off
    //    for (;;) {
    //        for (int i=0; i<5; i++) {
    //            _Pin::LED_GREEN_::Write(0);
    //            for (volatile int i=0; i<0xFFFF; i++);
    //            _Pin::LED_GREEN_::Write(1);
    //            for (volatile int i=0; i<0xFFFF; i++);
    //        }
    //    }
        
        // Start Scheduler
    //    _Scheduler::Start<_TaskButton>();
        _Scheduler::Start<_TaskI2C, _TaskMotion>();
        
        // Pause captures upon power on. This is so that the device is off until
        // the user turns it on by holding the power button.
        _OffAssertion = true;
        
