toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        for (;;) {
            const _Button::Event ev = _Button::WaitForEvent();
            // Ignore all interaction in host mode
            if (_TaskI2C::HostModeEnabled()) continue;
            
            // Keep the lights on until we're done handling the event
            _Powered::Assertion power(true);
            
            switch (ev) {
            case _Button::Event::Press: {
                // Ignore button presses if we're off
                if (_OffAssertion) break;
                
                for (auto it=_Triggers::ButtonTriggerBegin(); it!=_Triggers::ButtonTriggerEnd(); it++) {
                    _CaptureStart(*it, _RTC::TimeRead());
                }
                break;
            }
            
            case _Button::Event::Hold:
                if (_OffAssertion) {
                    // Deassert capture pause -- ie, turn on
                    _OffAssertion = false;
                    // Flash green LEDs
                    _LEDFlash(_LEDGreen_);
                
                } else {
                    // Assert capture pause -- ie, turn off
                    _OffAssertion = true;
                    // Flash red LEDs
                    _LEDFlash(_LEDRed_);
                }
                
                _Button::WaitForDeassert();
                
//                _Pause.toggle();
//                if (_Pause.asserted()) {
//                    // Flash red LED to signal that we're turning off
//                    for (int i=0; i<5; i++) {
//                        _Pin::LED_RED_::Write(0);
//                        _Scheduler::Delay(_Scheduler::Ms(50));
//                        _Pin::LED_RED_::Write(1);
//                        _Scheduler::Delay(_Scheduler::Ms(50));
//                    }
//                }
//                
//                #warning TODO: disable any timer interrupt sources that we may have set up, so we don't wake to take a photo
//                
//                _MOTION_SIGNAL_DISABLED::Init<_Pin::MOTION_SIGNAL>();
//                
//                // Configure button for device turning off
//                _Button::OffConfig();
//                
//                // Turn off
//                __Sleep(_SleepMode::Deep);
                break;
            }
        }
    }
    
    static void _LEDFlash(OutputPriority& led) {
        // Flash red LED to signal that we're turning off
        for (int i=0; i<5; i++) {
            led.set(_LEDPriority::Power, 0);
            _Scheduler::Delay(_Scheduler::Ms(50));
            led.set(_LEDPriority::Power, 1);
            _Scheduler::Delay(_Scheduler::Ms(50));
        }
        led.set(_LEDPriority::Power, std::nullopt);
    }
    
    // _OffAssertion: controls user-visible on/off behavior
    // By default, captures are paused so that the device is off until
    // the user turns it on by holding the power button.
    static inline _CapturePaused::Assertion _OffAssertion;
    
    // Task stack
    static constexpr auto& Stack = _TaskButtonStack;
};

// MARK: - IntState

inline bool Toastbox::IntState::Get() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::Set(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

// MARK: - Sleep

static void _Sleep() {
    // Put ourself to sleep until an interrupt occurs. This function may or may not return:
    // 
    // - This function returns if an interrupt was already pending and the ISR
    //   wakes us (via `__bic_SR_register_on_exit`). In this case we never enter LPM3.5.
    // 
    // - This function doesn't return if an interrupt wasn't pending and
    //   therefore we enter LPM3.5. The next time we wake will be due to a
    //   reset and execution will start from main().
    
    // If deep sleep is OK, enter LPM3.5 sleep, where RAM content is lost.
    // Otherwise, enter LPM1 sleep, because something is running.
    
//    const uint16_t mode = (_PowerAssertion::Acquired() ? LPM1_bits : LPM3_bits);
    
//    // If nothing asserts that we remained powered, enter LPM3.5
//    if (!_PowerAssertion::Acquired()) {
//        PMMUnlock pmm; // Unlock PMM registers
//        PMMCTL0_L |= PMMREGOFF_L;
//    }
    
    // Remember our current interrupt state, which IntState will restore upon return
    Toastbox::IntState ints;
    // Atomically enable interrupts and go to sleep
    __bis_SR_register(GIE | LPM3_bits);
}

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC::ISR();
}

[[gnu::interrupt(PORT2_VECTOR)]]
static void _ISR_Port2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    const uint16_t iv = P2IV;
    switch (__even_in_range(iv, 0x10)) {
    
    // Motion
    case _Pin::MOTION_SIGNAL::IVPort2():
        _Motion::ISR();
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    // I2C (ie VDD_B_3V3_STM)
    case _I2C::Pin::Active::IVPort2():
        _I2C::ISR_Active(iv);
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    // Button
    case _Button::Pin::IVPort2():
        _Button::ISR();
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt(USCI_B0_VECTOR)]]
static void _ISR_USCI_B0() {
    // Accessing `UCB0IV` automatically clears the highest-priority interrupt
    const uint16_t iv = UCB0IV;
    _I2C::ISR_I2C(iv);
    // Wake ourself
    __bic_SR_register_on_exit(LPM0_bits);
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

[[gnu::interrupt(ADC_VECTOR)]]
static void _ISR_ADC() {
    _BatterySampler::ISR(ADCIV);
    // Wake ourself
    __bic_SR_register_on_exit(LPM3_bits);
}

// MARK: - Abort

[[noreturn]]
static void _SchedulerStackOverflow() {
    Abort(MSP::Domain_::SchedulerStackOverflow, 0);
}

